app/services/chat_worker.rb

SELECT "chat_sessions".* FROM "chat_sessions" WHERE "chat_sessions"."id" = 9 LIMIT 1
UPDATE "chat_sessions" SET "kimi_session_id" = 'session_183095fe-8348-4652-9cce-246d25751346', "updated_at" = '2026-07-27 04:51:20.539104' WHERE "chat_sessions"."id" = 9
---
  def perform
    # 检索注入：企业文件片段 + company.db 数据样例
    retrieval = EnterpriseRetriever.build_context(@prompt, ip: @ip)
    full_prompt = retrieval[:context].present? ? "#{retrieval[:context]}\n用户问题：#{@prompt}" : @prompt

    ActiveRecord::Base.connection_pool.with_connection do
      chat_session = ChatSession.find(@chat_session_id)

      options = nil
      if chat_session.kimi_session_id.present?
        options = KimiAgentSDK::KimiAgentOptions.new(resume: chat_session.kimi_session_id)
      end

      reply = +""
      kimi_session_id = chat_session.kimi_session_id

      KimiAgentSDK.query(prompt: full_prompt, options: options) do |message|
        case message
        when KimiAgentSDK::AssistantMessage
          reply << message.content.to_s << "\n"
        when KimiAgentSDK::ResultMessage
          kimi_session_id = message.session_id
        end
      end

      chat_session.update!(kimi_session_id: kimi_session_id) if kimi_session_id.present?

INSERT INTO "audit_logs" ("action", "detail", "ip", "created_at", "updated_at") VALUES ('ask', 'prompt=上海的考勤制度和本地的区别是什么; sources=百瑞吉总部考勤规程.txt, 百瑞吉品牌一部考勤细则.txt, company.db', '10.1.20.3', '2026-07-27 04:51:20.566546', '2026-07-27 04:51:20.566546') RETURNING "id"
---
      )

      source_names = retrieval[:sources].map { |s| s[:name] }.join(", ")
      AuditLog.create!(
        action: "ask",
        detail: "prompt=#{@prompt.truncate(200)}; sources=#{source_names.presence || '无'}",
        ip: @ip
      )