app/services/enterprise_file_service.rb

  def self.read(rel_path, ip: nil)
    path = root.join(rel_path.to_s).expand_path

    # 防目录穿越：展开后必须仍在根目录内（Windows 路径不区分大小写）
    unless path.to_s.downcase.start_with?(root.to_s.downcase + File::SEPARATOR)
      raise Error, "非法路径（目录穿越）: #{rel_path}"
    end
    raise Error, "文件不存在: #{rel_path}" unless path.file?

    # 按字节读取后做编码归一：优先 UTF-8；不是合法 UTF-8 时按 GBK 转码
    # （国内企业环境常见 GBK/GB2312 编码的 Excel 导出文件），避免中文变乱码
    raw = File.binread(path.to_s, MAX_BYTES)
    content = raw.dup.force_encoding(Encoding::UTF_8)
    unless content.valid_encoding?
      content = raw.dup.force_encoding(Encoding::GBK)
                   .encode(Encoding::UTF_8, invalid: :replace, undef: :replace)
    end
    content = content.scrub

    AuditLog.create!(action: "file_read", detail: rel_path.to_s, ip: ip)
---
INSERT INTO "audit_logs" ("action", "detail", "ip", "created_at", "updated_at") VALUES ('file_read', '2026年销售情况.csv', NULL, '2026-07-28 08:49:48.645227', '2026-07-28 08:49:48.645227') RETURNING "id"