app/services/enterprise_query_service.rb

INSERT INTO "audit_logs" ("action", "detail", "ip", "created_at", "updated_at") VALUES ('sql_query', '[company] SELECT * FROM departments', NULL, '2026-07-27 08:29:14.328103', '2026-07-27 08:29:14.328103') RETURNING "id"
---
  def self.audit(source, sql, ip)
    AuditLog.create!(action: "sql_query", detail: "[#{source}] #{sql.to_s.truncate(490)}", ip: ip)