app/controllers/chat_controller.rb

  def ask
    prompt = params[:prompt].to_s.strip
    return render json: { error: "prompt 不能为空" }, status: :bad_request if prompt.empty?

    chat_session = ChatSession.find_by(id: params[:session_id]) if params[:session_id].present?
    chat_session ||= ChatSession.create!(title: prompt.truncate(30))
    chat_session.messages.create!(role: "user", content: prompt)
---
SELECT "chat_sessions".* FROM "chat_sessions" WHERE "chat_sessions"."id" = 9 LIMIT 1
INSERT INTO "chat_sessions" ("kimi_session_id", "title", "created_at", "updated_at") VALUES (NULL, '自检测试：接口验证', '2026-07-29 02:00:24.322525', '2026-07-29 02:00:24.322525') RETURNING "id"
INSERT INTO "messages" ("role", "content", "chat_session_id", "created_at", "updated_at", "sources") VALUES ('user', '自检测试：接口验证', 19, '2026-07-29 02:00:24.362041', '2026-07-29 02:00:24.362041', NULL) RETURNING "id"

  def history
    chat_session = ChatSession.includes(:messages).find_by(id: params[:session_id])
    return render json: { error: "会话不存在" }, status: :not_found unless chat_session

    render json: {
      session_id: chat_session.id,
      title: chat_session.title,
      messages: chat_session.messages.order(:created_at, :id).map do |m|
---
SELECT "chat_sessions".* FROM "chat_sessions" WHERE "chat_sessions"."id" = 9 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."chat_session_id" = 9
SELECT "messages".* FROM "messages" WHERE "messages"."chat_session_id" = 9 ORDER BY "messages"."created_at" ASC, "messages"."id" ASC

  def sessions
    list = ChatSession.includes(:messages).order(updated_at: :desc).limit(50)
    render json: list.map { |s|
      last_assistant = s.messages.select { |m| m.role == "assistant" }.max_by { |m| [m.created_at, m.id] }
---
SELECT "chat_sessions".* FROM "chat_sessions" ORDER BY "chat_sessions"."updated_at" DESC LIMIT 50
SELECT "messages".* FROM "messages" WHERE "messages"."chat_session_id" IN (18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4)
INSERT INTO "messages" ("role", "content", "chat_session_id", "created_at", "updated_at") VALUES ('user', '公司销售部有多少人？请用数据库回答', 4, '2026-07-27 03:25:16.288126', '2026-07-27 03:25:16.288126') RETURNING "id"

  def destroy_session
    chat_session = ChatSession.find_by(id: params[:id])
    return render json: { error: "会话不存在" }, status: :not_found unless chat_session

    chat_session.destroy!
---
SELECT "chat_sessions".* FROM "chat_sessions" WHERE "chat_sessions"."id" = 9999 LIMIT 1
DELETE FROM "chat_sessions" WHERE "chat_sessions"."id" = 19